ЕРПУХАстенд.cbr_Основной/src/Enums/СтатусыЗаказовНаПроизводство2_2/СтатусыЗаказовНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="555d6846-e773-489b-bd3c-89b1f2072899">
  <name>СтатусыЗаказовНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f552acdf-34c7-46f3-8d72-fc207a70ea04">
    <name>Формируется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АктуализацияСпецификаций</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеСпецтребований</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
  </enumValues>
  <enumValues>
    <name>Разработка</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
  </enumValues>
  <enumValues extendedConfigurationObject="c3e0c47c-9d7b-4349-82a5-35dfcec47e59">
    <name>КПроизводству</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
  </enumValues>
  <enumValues>
    <name>ПередачаНаСклад</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
  </enumValues>
  <enumValues extendedConfigurationObject="7cac9ffb-82fe-4e2c-8db3-94162621dc09">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказНаПроизводство2_2/ЗаказНаПроизводство2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04b45cc8-19da-4fc2-ab25-fcf16e66f5ee">
  <name>ЗаказНаПроизводство2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГосЗаказ</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеТребования</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="15fca05d-7959-4a2b-9062-e424f3982539">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6df6fc76-a3cd-4de0-a023-25f5c09faf10">
    <name>НачатьНеРанее</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="91b5bd8a-a202-4ee3-a07e-d2244bd4d2bb">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8b15-f8e1-48f5-a895-0a0068c7711a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="25c088f7-7f66-4e72-9549-39343550e4b5">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff56eabe-a6d5-4725-a7e1-6d3c1cffefbc">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="191fc3ee-3065-4648-ad89-72b3cbf6a108">
    <name>ДатаПотребности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88a5e505-c602-47c9-9dd8-4b109bf0874f">
    <name>ДинамическаяСтруктура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb924568-6ab5-4bc3-9ed4-53888e5a2470">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0190487c-4b35-4793-bebb-cdc5d67bf079">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a32405d7-b213-4b91-8842-bc3b27c23a17">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dd131bed-f4cf-4ccb-8427-639b59bd5bf2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7a6e457f-9de3-483b-9f11-8235c0db3365">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ce2f7918-6eb6-44a1-9703-eaa30ed728d8">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8fb6ec89-8b54-4467-a7ee-20b1f54a8233">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4429caf-ac6e-49ad-bef0-355badcab738">
    <name>КоличествоУпаковокПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e4bc4c5c-4c75-4666-8d21-f7f403a23514">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cef36287-09dd-4448-9e9e-5c90a8111d2c">
    <name>НаименованиеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Очередь</name>
    <comment>// Османов Н.М. 28.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>31</precision>
        <scale>15</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="e9606203-88e5-4b62-bc25-9f152c0eecfe">
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9e76279a-4f34-44a9-b997-752bfa2a4a30">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <comment>// Османов Н.М. 27.11.2023 ЧТЗ №2 Управление производством</comment>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d12a6578-0ee7-4c40-a0c0-f24b03afa6bc">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2e72bf9d-e251-478c-bd3e-7fb8e78584c0">
    <name>ТребуетсяЗаполнитьПоОперациям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88bb5796-07b6-4854-bafc-05701368c7dc">
    <name>ФактическоеНачалоЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97258e31-badf-4c52-808f-88d24f4369d1">
    <name>ФактическоеОкончаниеЭтапа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d65a15ce-a56d-4017-bbbc-210858c2c05f">
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="273df2c3-514f-4b41-af58-a60420b68979">
    <name>КоличествоУпаковокФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>П3_СлужебныйПересчетВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтатусДоКонтроля</name>
    <type>
      <types>EnumRef.СтатусыЭтаповПроизводства2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДатаДокументКотнроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ВремяКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <comment>// Османов Н.М. 21.11.2023 ЧТЗ №Действия в производстве</comment>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗавершенияФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнесеноФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТемператураФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДавлениеФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияПлан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращенияФакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f0cdedc1-9f3a-4821-ab6c-f2792fa18854">
    <name>ВыходныеИзделияСерии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="028a2250-ffdf-406c-868f-fb624d295146">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="96e6c801-bf9a-48f0-9e19-1f68a05fe6eb">
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2849e137-bfbf-4c16-b65f-8183ef3dcfd6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e615f87c-b1fe-424a-ba73-2107af37992d">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fc5c02ab-4758-47ca-a469-aeac95072209">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>П3_НазначениеДоПересчета</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/CommonModules/ФормированиеЭтаповПроизводства/Module.bsl
#Область СлужебныеПроцедурыИФункции
&ИзменениеИКонтроль("СформироватьПорциюЭтапов")
Процедура cbr_СформироватьПорциюЭтапов(ГруппыИзделий, Изделия, КлючиПартий, Параметры, Результат, АдресХранилища)

	РезультатФормирования = Результат.РезультатФормирования;
	СозданныеОбъекты = Результат.СозданныеОбъекты;
	Ошибки = Результат.Ошибки;
	Сообщения = Результат.Сообщения;

	ПередатьКВыполнениюВсе = Параметры.ВариантПередачиЭтаповКВыполнению = "Все";
	ПередатьКВыполнениюПервые = Параметры.ВариантПередачиЭтаповКВыполнению = "Первые";
	ИспользуетсяГрафикПроизводства = УправлениеПроизводствомПовтИсп.ИспользуетсяГрафикПроизводства();

	Изделия.Индексы.Добавить("НомерГруппы");

	ЗаданияКРасчетуГрафика = КлючиПартий.Скопировать(, "ЗаказНаПроизводство, КлючПартия");
	ЗаданияКРасчетуГрафика.Свернуть("ЗаказНаПроизводство, КлючПартия");
	ЗаданияКРасчетуГрафика.Колонки.Добавить("Очередь", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла()));
	ЗаданияКРасчетуГрафика.Индексы.Добавить("КлючПартия");

	СтруктураПоискаГруппа = Новый Структура("НомерГруппы");
	СтруктураПоискаРаспоряжение = Новый Структура("Распоряжение", Документы.ЗаказНаПроизводство2_2.ПустаяСсылка());
	СтруктураПоискаКлючПартия = Новый Структура("КлючПартия");

	ИменаКолонок = Новый Массив;
	Для каждого Колонка Из Изделия.Колонки Цикл
		Если Колонка.Имя <> "НомерГруппы"
			И Колонка.Имя <> "НомерПартииВГруппе"
			И Колонка.Имя <> "Количество" Тогда
			ИменаКолонок.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	КолонкиГруппировок = СтрСоединить(ИменаКолонок, ",");

	ГруппыКУдалению = Новый Массив;

	// Создание заказов
	УстановитьПривилегированныйРежим(Истина);
	Для каждого Группа Из ГруппыИзделий.НайтиСтроки(СтруктураПоискаРаспоряжение) Цикл

		СчетчикОшибок = 1;
		Пока Истина Цикл

			Попытка

				РеквизитыШапки = Новый Структура;

				РеквизитыШапки.Вставить("Подразделение", Группа.ПодразделениеДиспетчер);
				РеквизитыШапки.Вставить("Организация", Группа.Организация);
				РеквизитыШапки.Вставить("НаправлениеДеятельности", Группа.НаправлениеДеятельности);
				РеквизитыШапки.Вставить("ХозяйственнаяОперация", Группа.ХозяйственнаяОперация);
				РеквизитыШапки.Вставить("Партнер", Группа.Партнер);
				РеквизитыШапки.Вставить("Договор", Группа.Договор);
				РеквизитыШапки.Вставить("ЗаказПодДеятельность", Группа.ЗаказПодДеятельность);
				РеквизитыШапки.Вставить("РазмещениеВыпуска", Перечисления.СпособыПривязкиОперацийПроизводства.КОкончанию);
				РеквизитыШапки.Вставить("НачатьНеРанее", Группа.НачатьНеРанее);
				РеквизитыШапки.Вставить("ДатаПотребности", Группа.ДатаПотребности);

				Если ЗначениеЗаполнено(Группа.Приоритет) Тогда
					РеквизитыШапки.Вставить("Приоритет", Группа.Приоритет);
					РеквизитыШапки.Вставить("Очередь",
					Документы.ЗаказНаПроизводство2_2.НомерОчередиДляВставкиПередДокументами(Группа.СледующийЗаказВОчереди));
				КонецЕсли;

				РеквизитыШапки.Вставить("ДинамическаяСтруктура", Истина);
				РеквизитыШапки.Вставить("Дата", ТекущаяДатаСеанса());
				РеквизитыШапки.Вставить("Статус", Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству);
				РеквизитыШапки.Вставить("ВариантОбособления", Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции);
				РеквизитыШапки.Вставить("Комментарий", НСтр("ru = 'Сформирован автоматически (запуск партий)';
				|en = 'Generated automatically (lot launch)'"));

				СтруктураПоискаГруппа.НомерГруппы = Группа.НомерГруппы;
				Товары = Изделия.Скопировать(СтруктураПоискаГруппа);
				Товары.Свернуть(КолонкиГруппировок, "Количество");

				ДанныеЗаполнения = Новый Структура;
				ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
				ДанныеЗаполнения.Вставить("Товары", Товары);

				Заказ = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
				Заказ.Заполнить(ДанныеЗаполнения);

				// Отказ от проверки заполнения дополнительных реквизитов
				ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияСвойств = Истина;

				Если Заказ.ПроверитьЗаполнение() Тогда
					Заказ.Записать(РежимЗаписиДокумента.Проведение);

					Группа.Распоряжение = Заказ.Ссылка;
					Для каждого Изделие Из Изделия.НайтиСтроки(СтруктураПоискаГруппа) Цикл
						Изделие.Распоряжение = Заказ.Ссылка;
					КонецЦикла;
					СозданныеОбъекты.Добавить(Заказ.Ссылка);
				Иначе
					ДобавитьОшибку(Ошибки, Группа, Изделия);

					ГруппыКУдалению.Добавить(Группа);

					Для каждого Изделие Из Изделия.НайтиСтроки(СтруктураПоискаГруппа) Цикл
						Изделия.Удалить(Изделие);
					КонецЦикла;
				КонецЕсли;

				// Фиксация результата
				ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

			Исключение

				Событие = НСтр("ru = 'Этап производства';
				|en = 'Production stage'", ОбщегоНазначения.КодОсновногоЯзыка()) + "."
				+ НСтр("ru = 'Формирование этапов';
				|en = 'Generate stages'", ОбщегоНазначения.КодОсновногоЯзыка());

				Если СчетчикОшибок < 3 Тогда
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Неудачная попытка записи (%1): %2';
					|en = 'Unsuccessful attempt to write (%1): %2'"),
					СчетчикОшибок, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);

					СчетчикОшибок = СчетчикОшибок + 1;
					Продолжить;
				КонецЕсли;

				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

				ДобавитьОшибку(Ошибки, Группа, Изделия, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

			КонецПопытки;

			Прервать;

		КонецЦикла;

	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);

	Для каждого Группа Из ГруппыКУдалению Цикл
		ГруппыИзделий.Удалить(Группа);
	КонецЦикла;

	//
	ГруппыИзделий.Индексы.Добавить("НомерГруппы");
	Изделия.Индексы.Добавить("НомерГруппы");
	Изделия.Индексы.Добавить("НомерГруппы, НомерПартииВГруппе");
	СтруктураПоискаПартия = Новый Структура("НомерГруппы, НомерПартииВГруппе");

	//
	ДанныеПартии = Новый Структура;
	ДанныеПартии.Вставить("ДинамическаяСтруктура", Истина);
	ДанныеПартии.Вставить("ПартияПроизводства", Неопределено);
	ДанныеПартии.Вставить("НазначениеПродукция");
	ДанныеПартии.Вставить("Распоряжение");
	ДанныеПартии.Вставить("Спецификация");
	ДанныеПартии.Вставить("ТипПроизводственногоПроцесса");

	// Чтение данных спецификаций
	ПараметрыВыборки = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных();
	ПараметрыВыборки.УчитыватьВероятностьБрака = Ложь;
	ПараметрыВыборки.РассчитыватьДолиСтоимостиВыходныхИзделий = Истина;
	ПараметрыВыборки.ПолучитьПромежуточныйВыпуск = Истина;

	ДанныеСпецификаций = Справочники.РесурсныеСпецификации.ДанныеСпецификацииПоСпискуНоменклатуры(
	Изделия,
	ПараметрыВыборки,
	Истина,
	"НомерГруппы,НомерПартииВГруппе");

	// Создание партий
	ПартииПроизводства = Новый ТаблицаЗначений();
	ПартииПроизводства.Колонки.Добавить("Код", Новый ОписаниеТипов("Число"));
	ПартииПроизводства.Колонки.Добавить("ПартияПроизводства", Новый ОписаниеТипов("СправочникСсылка.ПартииПроизводства"));
	ПартииПроизводства.Колонки.Добавить("ДанныеСпецификацииИндексСтроки", Новый ОписаниеТипов("Число"));

	Для Каждого Реквизит Из Метаданные.Справочники.ПартииПроизводства.Реквизиты Цикл
		ПартииПроизводства.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;

	Для Каждого ТабличнаяЧасть Из Метаданные.Справочники.ПартииПроизводства.ТабличныеЧасти Цикл
		Если ТабличнаяЧасть.Имя = "ДополнительныеРеквизиты" Тогда
			Продолжить;
		КонецЕсли;
		ПартииПроизводства.Колонки.Добавить(ТабличнаяЧасть.Имя, Новый ОписаниеТипов("ТаблицаЗначений"));
	КонецЦикла;

	Для Индекс = 0 По ДанныеСпецификаций.ВГраница() Цикл
		ДанныеСпецификации = ДанныеСпецификаций[Индекс];
		Группа = ГруппыИзделий.Найти(ДанныеСпецификации.НомерГруппы, "НомерГруппы");
		Если Группа.Распоряжение.Пустая() Тогда
			Продолжить; // Заказ не был проведен
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ДанныеПартии, Группа, "Распоряжение, НазначениеПродукция");
		ЗаполнитьЗначенияСвойств(ДанныеПартии, ДанныеСпецификации, "Спецификация, ТипПроизводственногоПроцесса");
		ПоляПартии = Документы.ЭтапПроизводства2_2.ПоляПартии(
		ДанныеПартии, ДанныеСпецификации.ОсновноеИзделие,, ДанныеСпецификации);

		СтрокаПартия = ПартииПроизводства.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПартия, ПоляПартии);
		СтрокаПартия.ДанныеСпецификацииИндексСтроки = Индекс;
	КонецЦикла;

	Если ПартииПроизводства.Количество() <> 0 Тогда

		// Формируем ключи аналитик учета затрат (партии производства)
		Справочники.ПартииПроизводства.СформироватьПартииПроизводстваДляСпискаЭтапов(ПартииПроизводства);

		// Кешируем место партии в структуре заказа
		МестоПартииВСтруктуреЗаказа = РегистрыСведений.МестоПартииВСтруктуреЗаказа.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Для Индекс = -ПартииПроизводства.Количество()+1 По 0 Цикл
			СтрокаПартия = ПартииПроизводства[-Индекс];
			Если СтрокаПартия.ПартияПроизводства.Пустая() Тогда
				ДанныеСпецификаций.Удалить(СтрокаПартия.ДанныеСпецификацииИндексСтроки);
			Иначе
				ДанныеСпецификации = ДанныеСпецификаций[СтрокаПартия.ДанныеСпецификацииИндексСтроки];
				ДанныеСпецификации.Вставить("ПартияПроизводства", СтрокаПартия.ПартияПроизводства);

				НоваяСтрока = МестоПартииВСтруктуреЗаказа.Добавить();
				НоваяСтрока.Партия = СтрокаПартия.ПартияПроизводства;
				НоваяСтрока.ГруппаИзделий = СтруктураЗаказа.ГруппаИзделийКонтрольнаяСумма(СтрокаПартия,
				"Спецификация", "Документ");

				ЗаполнитьЗначенияСвойств(СтруктураПоискаПартия, ДанныеСпецификации, "НомерГруппы, НомерПартииВГруппе");
				НайденныеСтроки = Изделия.НайтиСтроки(СтруктураПоискаПартия);
				ВсегоСтрок = НайденныеСтроки.Количество();
				Если ВсегоСтрок > 0 Тогда
					НоваяСтрока.Уровень = НайденныеСтроки[0].Уровень;
					НоваяСтрока.ДлительностьДоВыпуска = НайденныеСтроки[0].ДлительностьДоВыпуска;
					НоваяСтрока.ИдентификаторВГруппеИзделий = НайденныеСтроки[0].ИдентификаторВГруппеИзделий;
					Для ИндексИзделия = 1 По ВсегоСтрок-1 Цикл
						НайденнаяСтрока = НайденныеСтроки[ИндексИзделия];
						НоваяСтрока.Уровень = Макс(НоваяСтрока.Уровень, НайденнаяСтрока.Уровень);
						НоваяСтрока.ДлительностьДоВыпуска = Макс(НоваяСтрока.ДлительностьДоВыпуска, НайденнаяСтрока.ДлительностьДоВыпуска);
						НоваяСтрока.ИдентификаторВГруппеИзделий = Макс(НоваяСтрока.ИдентификаторВГруппеИзделий, НайденнаяСтрока.ИдентификаторВГруппеИзделий);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
		РегистрыСведений.МестоПартииВСтруктуреЗаказа.ЗаписатьНовыеПартии(МестоПартииВСтруктуреЗаказа);

	КонецЕсли;

	//
	СсылкиПроведен = Новый Массив;
	ЭтапыКПереносуГрафика = Неопределено;

	Если ИспользуетсяГрафикПроизводства Тогда
		ЭтапыКПереносуГрафика = Новый ТаблицаЗначений;
		ЭтапыКПереносуГрафика.Колонки.Добавить("ЗаказНаПроизводство", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2"));
		ЭтапыКПереносуГрафика.Колонки.Добавить("КлючПартияСтарый", Новый ОписаниеТипов("УникальныйИдентификатор"));
		ЭтапыКПереносуГрафика.Колонки.Добавить("КлючПартияНовый", Новый ОписаниеТипов("УникальныйИдентификатор"));
		ЭтапыКПереносуГрафика.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
		ЭтапыКПереносуГрафика.Колонки.Добавить("Этап", Новый ОписаниеТипов("СправочникСсылка.ЭтапыПроизводства"));
	КонецЕсли;

	Для каждого ДанныеСпецификации Из ДанныеСпецификаций Цикл
		Группа = ГруппыИзделий.Найти(ДанныеСпецификации.НомерГруппы, "НомерГруппы");
		Если Группа.Распоряжение.Пустая() Тогда
			Продолжить; // Заказ не был проведен
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(СтруктураПоискаПартия, ДанныеСпецификации, "НомерГруппы, НомерПартииВГруппе");
		ИзделияПартии = Изделия.Скопировать(СтруктураПоискаПартия);
		Если ИзделияПартии.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		Изделие = ИзделияПартии[0];
		КлючПартияНовый = ДанныеСпецификации.ПартияПроизводства.УникальныйИдентификатор();

		ПеренестиГрафик = ИспользуетсяГрафикПроизводства
		И ИзделияПартии.Количество() = 1
		И Изделие.КоличествоПартий = 1
		И Изделие.Количество = Изделие.КоличествоНорматив
		И НачалоДня(Изделие.ДатаЗапуска) = НачалоДня(Изделие.ДатаЗапускаНорматив)
		И ЗначениеЗаполнено(Изделие.КлючПартия);

		// Задания на расчет графика
		Если ПеренестиГрафик Тогда
			СтруктураПоискаКлючПартия.КлючПартия = Изделие.КлючПартия;
			НайденныеСтроки = ЗаданияКРасчетуГрафика.НайтиСтроки(СтруктураПоискаКлючПартия);
			Если НайденныеСтроки.Количество() <> 0 Тогда
				ЗаданияКРасчетуГрафика.Удалить(НайденныеСтроки[0]);
			КонецЕсли;
		Иначе
			НоваяСтрока = ЗаданияКРасчетуГрафика.Добавить();
			НоваяСтрока.ЗаказНаПроизводство = Группа.Распоряжение;
			НоваяСтрока.КлючПартия = КлючПартияНовый;
		КонецЕсли;

		// Ссылка на партию
		НоваяСтрока = РезультатФормирования.Добавить();
		НоваяСтрока.Партия = ДанныеСпецификации.ПартияПроизводства;
		СозданныеОбъекты.Добавить(ДанныеСпецификации.ПартияПроизводства);

		// Плановая дата отгрузки и производства
		ДанныеСпецификации.Этапы.Колонки.Добавить("ДатаОтгрузки", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты));
		ДанныеСпецификации.Этапы.Колонки.Добавить("НеОтгружатьЧастями", Новый ОписаниеТипов("Булево"));
		ДанныеСпецификации.Этапы.Колонки.Добавить("ПланироватьНеРанее", 
		Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2, Дата",,, Новый КвалификаторыДаты));
		ДанныеСпецификации.Этапы.ЗаполнитьЗначения(Истина, "НеОтгружатьЧастями");
		ДанныеСпецификации.Этапы.ЗаполнитьЗначения(Группа.НачатьНеРанее, "ДатаОтгрузки");

		ДанныеСпецификации.Этапы.Колонки.Добавить("ДатаПроизводства", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты));
		ДанныеСпецификации.Этапы.Колонки.Добавить("ПроизводствоОднойДатой", Новый ОписаниеТипов("Булево"));
		ДанныеСпецификации.Этапы.ЗаполнитьЗначения(Истина, "ПроизводствоОднойДатой");

		Если Не ИспользуетсяГрафикПроизводства Тогда
			ДанныеСпецификации.Этапы.ЗаполнитьЗначения(Группа.ДатаПотребности, "ДатаПроизводства"); // Желаемая дата выпуска
		КонецЕсли;

		// Наследование реквизитов выпуска
		ЗаполнитьИзделияСпецификацииПоИзделиямКЗапуску(ДанныеСпецификации, ИзделияПартии);

		// Объект-имитация партии
		ЗаполнитьЗначенияСвойств(ДанныеПартии, Группа, "Распоряжение, НазначениеПродукция");
		ЗаполнитьЗначенияСвойств(ДанныеПартии, ДанныеСпецификации, "Спецификация, ТипПроизводственногоПроцесса");

		// Назначение материалов
		НазначенияМатериалов = ОбеспечениеПроизводства.КоэффицентыНазначенийОбеспеченияВЭтапеПроизводства(
		ДанныеПартии,
		ДанныеСпецификации.ВыходныеИзделия);
		ДанныеСпецификации.Вставить("НазначенияМатериалов", НазначенияМатериалов);

		// Дополнение данных спецификации
		Документы.ЭтапПроизводства2_2.ПодготовитьДанныеСпецификацииКСозданиюЭтапов(ДанныеСпецификации, ДанныеПартии);

		// Статус этапов
		ДанныеСпецификации.Этапы.Колонки.Добавить(
		"Статус", Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЭтаповПроизводства2_2"));

		Если ПередатьКВыполнениюВсе Тогда
			ДанныеСпецификации.Этапы.ЗаполнитьЗначения(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению, "Статус");
		Иначе
			Для каждого Этап Из ДанныеСпецификации.Этапы Цикл
				Если ПередатьКВыполнениюПервые И Этап.НомерЭтапа = 1 Тогда
					Этап.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению;
				Иначе
					Этап.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		// Очистка стека сообщений
		Для каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			Сообщения.Добавить(Сообщение);
		КонецЦикла;

		// Создание этапов
		РеквизитыШапки = УправлениеПроизводствомВызовСервера.ЗначенияЗаполненияНовогоЭтапаПроизводства(
		ДанныеСпецификации.Распоряжение,
		ДанныеСпецификации.НазначениеПродукция,
		ДанныеСпецификации.ПартияПроизводства,
		ДанныеСпецификации.ТипПроизводственногоПроцесса,
		ДанныеСпецификации.Спецификация);

		Для Индекс = 0 По ДанныеСпецификации.Этапы.Количество()-1 Цикл

			ДанныеЭтапа = ДанныеСпецификации.Этапы[Индекс];

			Если ДанныеЭтапа.НомерЭтапа = 1
				И ИспользуетсяГрафикПроизводства Тогда
				ДанныеЭтапа.ПланироватьНеРанее = ИзделияПартии[0].ДатаЗапуска;
			КонецЕсли;

			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("РеквизитыШапки", РеквизитыШапки);
			ДанныеЗаполнения.Вставить("ДанныеСпецификации", ДанныеСпецификации);
			ДанныеЗаполнения.Вставить("ДанныеЭтапа", ДанныеЭтапа);

			ДокументОбъект = Документы.ЭтапПроизводства2_2.СоздатьДокумент();
			ДокументОбъект.УстановитьСсылкуНового(ДанныеЭтапа.ЭтапПроизводства);
			ДокументОбъект.УстановитьРежимПакетногоФормирования();
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			#Вставка
			//++ cbr-georglarkov 06.02.26 ПРЗ.24
			Для каждого Материал из ДокументОбъект.ОбеспечениеМатериаламиИРаботами Цикл
				Если Материал.КоличествоУпаковок <> Цел(Материал.КоличествоУпаковок) 
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Материал.Номенклатура, "cbr_Округление")
					И Материал.КоличествоУпаковок = Материал.Количество Тогда
					Материал.КоличествоУпаковок = Цел(Материал.КоличествоУпаковок) + 1;
				КонецЕсли; 
			КонецЦикла;
			//-- cbr-georglarkov 06.02.26 ПРЗ.24
			#КонецВставки
			// Отказ от проверки заполнения дополнительных реквизитов
			ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияСвойств = Истина;

			Если Не ДокументОбъект.ПроверитьЗаполнение() Тогда
				ДокументОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Формируется;
			КонецЕсли;

			Пока Истина Цикл

				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					СсылкиПроведен.Добавить(ДокументОбъект.Ссылка);
				Исключение

					Если ДокументОбъект.Статус <> Перечисления.СтатусыЭтаповПроизводства2_2.Формируется Тогда
						ДокументОбъект.Статус = Перечисления.СтатусыЭтаповПроизводства2_2.Формируется;
						Продолжить;
					КонецЕсли;

					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);

				КонецПопытки;

				Прервать;

			КонецЦикла;

			НоваяСтрока = РезультатФормирования.Добавить();
			НоваяСтрока.Партия = ДанныеСпецификации.ПартияПроизводства;
			НоваяСтрока.Документ = ДокументОбъект.Ссылка;
			СозданныеОбъекты.Добавить(ДокументОбъект.Ссылка);

			Если ПеренестиГрафик Тогда
				НоваяСтрока = ЭтапыКПереносуГрафика.Добавить();
				НоваяСтрока.ЗаказНаПроизводство = ДокументОбъект.Распоряжение;
				НоваяСтрока.КлючПартияСтарый = ИзделияПартии[0].КлючПартия;
				НоваяСтрока.КлючПартияНовый = КлючПартияНовый;
				НоваяСтрока.Ссылка = ДокументОбъект.Ссылка;
				НоваяСтрока.Этап = ДокументОбъект.Этап;
			КонецЕсли;

			Для каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
				Сообщение.КлючДанных = ДокументОбъект.Ссылка;
				Сообщения.Добавить(Сообщение);
			КонецЦикла;

		КонецЦикла;

		// Фиксация результата
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	КонецЦикла;

	// Наследование графика
	Если ЗначениеЗаполнено(ЭтапыКПереносуГрафика) Тогда
		ГрафикПроизводстваСтруктурыЗаказа.ПеренестиГрафикПартийПриЗапуске(ЭтапыКПереносуГрафика);
	КонецЕсли;

	// Очистка стека сообщений
	Для каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
		Сообщения.Добавить(Сообщение);
	КонецЦикла;

	// Запись в регистры
	Если СсылкиПроведен.ВГраница() <> -1 Тогда
		Распоряжения = ОбщегоНазначенияУТ.УникальныеЗначенияИзКолонкиТаблицы(ГруппыИзделий, "Распоряжение");
		Очередь = Константы.ГраницаРасчетаСтруктурыЗаказов.ТекущаяОчередь();

		// Заполнение обеспечения и формирование движений 
		ПараметрыФормирования = Документы.ЭтапПроизводства2_2.ПараметрыФормированияЭтапов();
		ЗаполнитьЗначенияСвойств(ПараметрыФормирования, Параметры, "РезервироватьМатериалы, ЗаменятьМатериалыНаАналоги");
		ПараметрыФормирования.Распоряжения = Распоряжения;
		Документы.ЭтапПроизводства2_2.ЗаполнитьОбеспечениеИОтразитьДвиженияПоЭтапам(
		ПараметрыФормирования, СсылкиПроведен, Новый МенеджерВременныхТаблиц, Очередь);

		// Заполнение связанных регистров
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПооперационноеУправление")
			ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьПооперационноеПланирование") Тогда
			ЭтапыДляРасчетаОчередиЗаданий = Документы.ЭтапПроизводства2_2.ТребуетсяРассчитатьОчередьОпераций(СсылкиПроведен);
			Если ЭтапыДляРасчетаОчередиЗаданий.Количество() > 0 Тогда
				ТаблицаДанныхЗаданий = 
				РегистрыСведений.ЗаданияКРасчетуОчередиПроизводственныхОпераций.ИнициализироватьТаблицуДанныхЗаданий();
				Для Каждого ЭтапДляРасчета Из ЭтапыДляРасчетаОчередиЗаданий Цикл
					НоваяСтрока = ТаблицаДанныхЗаданий.Добавить();
					НоваяСтрока.ОбъектРасчета = ЭтапДляРасчета;
				КонецЦикла;
				РегистрыСведений.ЗаданияКРасчетуОчередиПроизводственныхОпераций.ДобавитьЗадания(ТаблицаДанныхЗаданий);
			КонецЕсли;
		КонецЕсли;

		РегистрыКОтражению = СостоянияДокументов.РегистрыКОтражениюСостоянияЗаказов();
		РегистрыКОтражению.СостоянияЭтаповПроизводства = Истина;

		СостоянияДокументов.ДобавитьЗаданияКОтражениюСостоянияЗаказов(
		Неопределено,
		СсылкиПроведен,
		"ДЕЙСТВИЕ_ОТРАЗИТЬ_СОСТОЯНИЕ_ЭТАПОВ",
		РегистрыКОтражению);

		РегистрыКОтражению = СостоянияДокументов.РегистрыКОтражениюСостоянияЗаказов();
		РегистрыКОтражению.СостоянияЗаказовНаПроизводство = Истина;

		СостоянияДокументов.ДобавитьЗаданияКОтражениюСостоянияЗаказов(
		Неопределено,
		Распоряжения,,
		РегистрыКОтражению);

		Если ЗаданияКРасчетуГрафика.Количество() > 0 Тогда
			ЗаданияКРасчетуГрафика.ЗаполнитьЗначения(Очередь, "Очередь");
			РегистрыСведений.ЗаданияКРасчетуСтруктурыЗаказаГрафикПроизводства.ДобавитьЗадания(ЗаданияКРасчетуГрафика);
		КонецЕсли;
	КонецЕсли;

	// Очистка стека сообщений
	Для каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
		Сообщения.Добавить(Сообщение);
	КонецЦикла;

	// Фиксация результата
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);

КонецПроцедуры
#КонецОбласти
